; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v6)
             (pred_4 ?v13 ?v7)
             (pred_7 ?v5 ?v7)
             (pred_10 ?v12 ?v5 )
	     (pred_8 ?v5)
             (pred_9 ?v9)
             (pred_12 ?v13)
             (pred_1 ?v7)
             (pred_3 ?v5)
             (pred_2 ?v13)
             (pred_6 ?v5)
             (pred_5 ))



(:action op_5
:parameters (?v11 ?v8 ?v2 ?v4)
:precondition (and (pred_9 ?v11) (pred_9 ?v8) (pred_12 ?v2) (pred_1 ?v4)
          (pred_11 ?v11 ?v8) (pred_4 ?v2 ?v4)
                   (pred_7 ?v8 ?v4) (pred_8 ?v11) 
                   (pred_3 ?v8) (pred_2 ?v2))
:effect (and  (pred_6 ?v8) (not (pred_3 ?v8))))


(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_9 ?v11) (pred_9 ?v10)
               (pred_8 ?v11) (pred_11 ?v11 ?v10) (pred_6 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v11))))

(:action op_3
:parameters (?v11 ?v2)
:precondition (and (pred_9 ?v11) (pred_12 ?v2) 
                  (pred_8 ?v11) (pred_10 ?v2 ?v11) (pred_5 ))
:effect (and (pred_2 ?v2)
   (not (pred_10 ?v2 ?v11)) (not (pred_5 ))))


(:action op_4
:parameters (?v11 ?v1 ?v3)
:precondition (and (pred_9 ?v11) (pred_12 ?v1) (pred_12 ?v3)
                  (pred_8 ?v11) (pred_2 ?v3) (pred_10 ?v1 ?v11))
:effect (and (pred_2 ?v1) (pred_10 ?v3 ?v11)
        (not (pred_2 ?v3)) (not (pred_10 ?v1 ?v11))))

(:action op_2
:parameters (?v11 ?v2)
:precondition (and (pred_9 ?v11) (pred_12 ?v2) 
                  (pred_8 ?v11) (pred_2 ?v2))
:effect (and (pred_5 ) (pred_10 ?v2 ?v11) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_08 obj_26 obj_11 obj_22 obj_01 obj_03 obj_07 obj_18 obj_21 obj_16 obj_09 obj_29 obj_27 obj_10 obj_15 obj_24 obj_28 obj_12 obj_25 obj_19 obj_05 obj_17 obj_04 obj_23
    obj_02 obj_20
    obj_13 obj_06 obj_30
    )

    (:init
       (pred_5)

       (pred_9 obj_14)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_01)
       (pred_9 obj_03)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_29)
       (pred_9 obj_27)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_24)
       (pred_9 obj_28)
       (pred_9 obj_12)
       (pred_9 obj_25)
       (pred_9 obj_19)
       (pred_9 obj_05)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_9 obj_23)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_12 obj_13)
       (pred_12 obj_06)
       (pred_12 obj_30)

       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_26 obj_07)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_26)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_18 obj_27)
       (pred_11 obj_18 obj_21)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_18)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_09 obj_29)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_29 obj_28)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_29 obj_07)
       (pred_11 obj_29 obj_09)
       (pred_11 obj_27 obj_12)
       (pred_11 obj_27 obj_10)
       (pred_11 obj_27 obj_18)
       (pred_11 obj_27 obj_29)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_27)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_24 obj_05)
       (pred_11 obj_24 obj_28)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_12)
       (pred_11 obj_28 obj_29)
       (pred_11 obj_28 obj_24)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_25)
       (pred_11 obj_12 obj_27)
       (pred_11 obj_12 obj_28)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_12)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_05 obj_24)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_04 obj_23)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_23 obj_04)
       (pred_3 obj_25)
       (pred_3 obj_21)
       (pred_3 obj_19)
       (pred_7  obj_25 obj_02)
       (pred_7  obj_21 obj_20)
       (pred_7  obj_19 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_26)
       (pred_6 obj_11)
       (pred_6 obj_22)
       (pred_6 obj_01)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_10)
       (pred_6 obj_15)
       (pred_6 obj_24)
       (pred_6 obj_28)
       (pred_6 obj_12)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_04)
       (pred_6 obj_23)

       (pred_4  obj_13 obj_02)
       (pred_4  obj_06 obj_20)
       (pred_4  obj_30 obj_02)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_06 obj_29)
       (pred_10 obj_30 obj_10)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_10 obj_30 obj_16)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_1 obj_01 obj_03)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_03)
   goals met: 0 of 1
2. (op_1 obj_03 obj_07)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_07)
   goals met: 0 of 1
3. (op_1 obj_07 obj_18)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_18)
   goals met: 0 of 1
4. (op_1 obj_18 obj_27)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_27)
   goals met: 0 of 1
5. (op_1 obj_27 obj_10)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_30)
   deleted: (pred_10 obj_30 obj_10) (pred_5)
   added: (pred_2 obj_30)
   goals met: 0 of 1
7. (op_1 obj_10 obj_27)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_27)
   goals met: 0 of 1
8. (op_1 obj_27 obj_29)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_29)
   goals met: 0 of 1
9. (op_1 obj_29 obj_07)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_07)
   goals met: 0 of 1
10. (op_1 obj_07 obj_03)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_03)
   goals met: 0 of 1
11. (op_1 obj_03 obj_01)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_01)
   goals met: 0 of 1
12. (op_1 obj_01 obj_16)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_16)
   goals met: 0 of 1
13. (op_2 obj_16 obj_30)
   deleted: (pred_2 obj_30)
   added: (pred_5) (pred_10 obj_30 obj_16)
   goals met: 1 of 1
